print('''
        파이썬 특징 및 장점
        
        * 배우기 쉽고 사용하기 쉬움

        * 성능은 조금 느리지만 생산성이 높아 C언어에 비해 개발 기간이 짧음
        
        * 플랫폼에 독립적이어서 어느 운영체제서나 사용 할 수 있음
            -> 이기종 간의 통신 환경인 웹에 유리함
        
        * 공개된 언어여서 비용이 들지 않음, 소스도 공개되어 있음
        
        * 실무에 필요한 고급 라이브러리를 대거 포함하고 있음
            -> 기본 패키지만 설치해도 왠만한 작업은 다 처리할 수 있음
            -> 이런 철학을 배터리 포함(Batteries included)라고 함
            -> 웹, 그래픽, 게임, 이미지 처리 등의 고성능 추가 패키지까지 있어 지원군이 든든함
        
        *  객체지향적이며 클래스를 지원함
            -> 간단하게 쓸 수도 있고 전문 개발 언어 못지 않는 복잡한 작업도 처리 가능

        * C 언어와의 접착성이 좋아 혼합 프로그래밍이 가능함
            -> 고성능이 필요한 엔진은 C로 만들고 자주 바뀌는 부분만 파이썬으로 작성
            -> 성능과 생산성을 모두 만족시킬 수 있음


        파이썬의 활용 분야

        * 유틸리티 제작
            -> 간단한 작업을 처리하는 시스템 유틸리티 제작에 적합
            -> 배치 파일이나 쉘 스크립트에 비해 성능이 월등해 간단한 관리 프로그램 제작에 최적

        * 웹 프로그랭밍
            -> 웹은 요구 사항이 번번이 바뀜
            -> 성능보다 신속한 대응과 유연성이 중요함
            -> 파이썬은 개발 기간이 짧고 플랫폼 독립적이어서 웹 개발에 유리
            -> 파이썬으로 운영되는 웹 사이트가 점점 늘고 있음

        * 임베디드
            -> 사물 인터넷(IoT)분야에 활용하여 초소형 컴퓨터 프로그래밍에 자주 사용
            -> 라즈베리파이 같은 임베디드 장비를 제어할 때 적합

        * 데이터베이스
            -> 대량의 정보를 저장하는 데이터베이스는 엔진의 효율이 좋기 때문에
            -> 사용자를 대면하는 부분은 스크립트 언어인 파이썬으로 작성해도 무리 없음
            -> 복잡한 업무규칙을 신속하게 구현하고 변화에 민첨하게 대응할 수 있음

        * 교육용
            -> 파이썬은 문법이 쉽고 개발 과정도 단순해 프로그래밍 초보자가 논리를 익히기에 더없이 좋은 언어
            -> 실무에까지 적용가능
    ''')

